Todo
====

* [10/10] Spellslinger: Survival
** DONE Fullscreen
** DONE Flexible NPC (Entity) abstraction
** DONE Notices
** DONE IO Scheduler
** DONE Player profile
** DONE Resource pre-loading
   :LOGBOOK:
   CLOCK: [2013-03-10 Sun 02:40]--[2013-03-10 Sun 03:16] =>  0:36
   :END:
** DONE Zombies are alerted by player movement 20 squares away
   :LOGBOOK:
   CLOCK: [2013-03-10 Sun 20:37]--[2013-03-10 Sun 21:14] =>  0:37
   :END:
** DONE Zombies alerted animation
   :LOGBOOK:
   CLOCK: [2013-03-10 Sun 21:25]--[2013-03-10 Sun 21:55] =>  0:30
   :END:
** DONE Score
   :LOGBOOK:
   CLOCK: [2013-03-24 Sun 19:00]--[2013-03-24 Sun 19:21] =>  0:21
   :END:
   Score is awarded for completed levels.  For each level you get:
   time spent in level x zombies in level points.

** DONE High Scores
   :LOGBOOK:
   CLOCK: [2013-03-27 Wed 14:34]--[2013-03-27 Wed 15:21] =>  0:47
   CLOCK: [2013-03-26 Tue 22:05]--[2013-03-26 Tue 22:47] =>  0:42
   CLOCK: [2013-03-25 Mon 21:00]--[2013-03-25 Mon 21:57] =>  0:57
   :END:

* [0/6] Spellslinger 2D
** TODO Distinguish between deterministic and non-deterministic games
** TODO Abstract out engine interface
   :LOGBOOK:
   CLOCK: [2013-07-09 Tue 21:53]--[2013-07-09 Tue 22:10] =>  0:17
   CLOCK: [2013-07-06 Sat 11:08]--[2013-07-06 Sat 11:46] =>  0:38
   CLOCK: [2013-07-06 Sat 11:06]--[2013-07-06 Sat 11:08] =>  0:02
   CLOCK: [2013-07-06 Sat 10:56]--[2013-07-06 Sat 11:00] =>  0:04
   CLOCK: [2013-07-06 Sat 10:50]--[2013-07-06 Sat 10:56] =>  0:06
   CLOCK: [2013-07-06 Sat 10:10]--[2013-07-06 Sat 10:47] =>  0:37
   :END:
** TODO GL/GLUT/GLEW-based engine
   :LOGBOOK:
   CLOCK: [2013-07-10 Wed 12:43]
   :END:
** TODO Retire SDL engine
** TODO Options menu
** TODO Use continuous updating in the game

** TODO Over the shoulder view
** Misc
   :LOGBOOK:
   CLOCK: [2013-07-06 Sat 11:00]--[2013-07-06 Sat 11:01] =>  0:01
   :END:
* Spellsliger: Arena
** TODO Dev console
** TODO Tutorial area
** TODO Geometric arenas
** TODO Promethean Magic
